---
lab:
  title: 'Exercício 06: realizar a busca de ameaças no Microsoft Sentinel'
  module: Guided Project - Create detections and perform investigations using Microsoft Sentinel
---

## Visão geral do exercício

Você é um(a) analista de operações de segurança que trabalha em uma empresa que implementou o Microsoft Sentinel. Você deve aprender a detectar e mitigar ameaças usando o Microsoft Sentinel. Depois de conectar as fontes de dados com o Microsoft Sentinel, crie regras de análise personalizadas para ajudar a descobrir ameaças e comportamentos anômalos no ambiente.

As consultas de busca de ameaças habilitam e capacitam os analistas SOC a monitorar e investigar proativamente possíveis ataques à medida que estão se desenvolvendo ou antes que aconteçam. A busca no Microsoft Sentinel permite que consultas semelhantes a regras analíticas sejam usadas para auditar o ambiente em busca de atividades potencialmente mal-intencionadas, permitindo que os analistas escalem os resultados para incidentes, se necessário. Às vezes, a busca de ameaças pode exigir dados que vão além da retenção do nível de análise (frequente), é aqui que recursos como trabalhos de Pesquisa/Restauração podem ser usados para garantir que o SOC tenha os dados necessários.

## Instruções para o exercício

### Tarefa 1: criar uma consulta de busca

Nesta tarefa, você criará uma consulta de busca e marcará um resultado.

1. Faça logon na máquina virtual WIN1 como Administrador com a senha: **Pa55w.rd**.  

1. No navegador Edge, acesse o portal do Azure em <https://portal.azure.com>.

1. Na caixa de diálogo **Entrar**, copie e cole a conta de **email do locatário** fornecida pelo provedor de hospedagem do laboratório e selecione **Avançar**.

1. Na caixa de diálogo **Inserir senha**, copie e cole a **Senha de locatário** fornecida pelo provedor de hospedagem do laboratório e selecione **Entrar**.

1. Na barra de Pesquisa do portal do Azure, digite *Sentinel* e selecione **Microsoft Sentinel**.

1. Selecione seu workspace do Microsoft Sentinel.

1. Selecione **Logs**

1. Insira a instrução KQL a seguir no espaço *Nova consulta 1*:

   >**Importante:** cole as consultas KQL primeiro no Bloco de notas e, em seguida, copie-as para a janela Log de *Nova consulta 1* para evitar erros.

    ```KQL
    let lookback = 2d; 
    SecurityEvent 
    | where TimeGenerated >= ago(lookback) 
    | where EventID == 4688 and Process =~ "powershell.exe"
    | extend PwshParam = trim(@"[^/\\]*powershell(.exe)+" , CommandLine) 
    | project TimeGenerated, Computer, SubjectUserName, PwshParam 
    | summarize min(TimeGenerated), count() by Computer, SubjectUserName, PwshParam 
    | order by count_ desc nulls last 
    ```
